---
kind: other
id: Methods.T:Autodesk.Revit.DB.Structure.AnalyticalOpening
source: html/83859be6-8efd-a84f-2af8-94df06edd509.htm
---
# AnalyticalOpening Methods

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.